# SetDefOpacityByClsN

## Description
```pascal
PROCEDURE SetDefOpacityByClsN(
				inIsPenOpacityByClass  : BOOLEAN;
				inIsFillOpacityByClass : BOOLEAN);
```

```python

def vs.SetDefOpacityByClsN(inIsPenOpacityByClass, inIsFillOpacityByClass):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|inIsPenOpacityByClass|BOOLEAN||
|inIsFillOpacityByClass|BOOLEAN||

## Version
Availability: from Vectorworks 2017
## Category
* Document Attributes